import random #библиотека рандом
s = random.randint(4, 8) #присваиваем s рандомное значение от 4 до 8
print("Размер матрицы:", s) #это значение станет размером
vse = [-3, -5, -2, -12, 0, 15, 4, 7, 2] #пишем список из элементов матрицы
m = [] # пустой список для строк матрицы
for i in range(s): #цикл который выполняется s раз
    row = [] # пустой список для каждой строки
    for j in range(s): #еще один цикл(столбцы)
        v = random.choice(vse) #присваиваем v случайный элемент из vse
        row.append(v) # добавляем v в row
    m.append(row) # и добавляем заполненное row в m
print("Сгенерированная матрица:") #выводим эти слова
for row in m: # перебераем строки в матрице
    for el in row: # перебераем элемент в строке
        print(f"{el:>3}", end=" ") #выводим элемент el с выравниванием по правой стороне и шириной 3 символа, заканчивая пробелом.
    print() # просто как пустая строка для красоты
sum = 0 #инициализируем sum
for row in m: #перебераем строки в матрицу
    for el in row: #перебераем элемент в строке
        if el % 2 == 0: #ищем четные
            sum += el #считаем их сумму
print("Сумма четных элементов:", sum) #выводим сумму
