import random #библиотека random

s = random.randint(4, 8) # случайное число от 4 до 8
print(f"Размер матрицы: {s}") # это число будет размерностью матрицы

l = [-3, -5, -2, -12, 0, 15, 4, 7, 2] #список элементов матрицы
m = [] # сам список для матрицы

for _ in range(s): # цикл, который будет длиться s раз ( _ это переменная, которая не будет использоваться в цикле)
    st = [random.choice(l) for _ in range(s)] # список st состоящий из s случайных значений l
    m.append(st) # каждая строка st добавляется в матрицу m

print("Матрица:") #выводим матрицу
for st in m: # перебераем строку в матрице
    for ch in st: # перебераем элемент в матрице
        print(f"{ch}", end="\t") # выводит текущее значение ch в таблице, используя форматирование
    print() # перехлдит на новую строку после завершения первой

sumCH = 0 # инициализируем
for st in m: # перебераем строку в матрице
    for ch in st: # перебераем элемент в матрице
        if ch % 2 == 0: # ставим условие четности
            sumCH += ch # считаем сумму

print(f"Сумма всех четных элементов: {sumCH}") # выводим сумму
